stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_ll_adc.c
/**
  ******************************************************************************
  * @file    stm32wl3x_ll_adc.c
  * @author  GPM Application Team
  * @brief   ADC LL module driver
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_ll_adc.h"
#include "stm32wl3x_ll_bus.h"

#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0UL)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32WL3x_LL_Driver
  * @{
  */

#if defined (ADC1)

/** @addtogroup ADC_LL ADC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup ADC_LL_Private_Constants
  * @{
  */

#define ADC_SWITCH_SE_VIN_ALL                       (ADC_SWITCH_SE_VIN_0 | ADC_SWITCH_SE_VIN_1 | \
                                                     ADC_SWITCH_SE_VIN_2 | ADC_SWITCH_SE_VIN_3 | \
                                                     ADC_SWITCH_SE_VIN_4 | ADC_SWITCH_SE_VIN_5 | \
                                                     ADC_SWITCH_SE_VIN_6 | ADC_SWITCH_SE_VIN_7)

#define ADC_SEQ_1_SEQ_ALL                           (ADC_SEQ_1_SEQ0 | ADC_SEQ_1_SEQ1 | \
                                                     ADC_SEQ_1_SEQ2 | ADC_SEQ_1_SEQ3 | \
                                                     ADC_SEQ_1_SEQ4 | ADC_SEQ_1_SEQ5 | \
                                                     ADC_SEQ_1_SEQ6 | ADC_SEQ_1_SEQ7)

#define ADC_SEQ_2_SEQ_ALL                           (ADC_SEQ_2_SEQ8  | ADC_SEQ_2_SEQ9  | \
                                                     ADC_SEQ_2_SEQ10 | ADC_SEQ_2_SEQ11 | \
                                                     ADC_SEQ_2_SEQ12 | ADC_SEQ_2_SEQ13 | \
                                                     ADC_SEQ_2_SEQ14 | ADC_SEQ_2_SEQ15)

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/** @addtogroup ADC_LL_Private_Macros
  * @{
  */
/* Check of parameters for configuration of ADC hierarchical scope:           */
/* ADC instance.                                                              */
#define IS_LL_ADC_NB_CONV(__LENGTH__) (((__LENGTH__) >= (1UL)) && ((__LENGTH__) <= (16UL)))

#define IS_LL_ADC_DATAWIDTH(__DATA_WIDTH__) (((__DATA_WIDTH__) == LL_ADC_DS_DATA_WIDTH_12_BIT) || \
                                             ((__DATA_WIDTH__) == LL_ADC_DS_DATA_WIDTH_13_BIT) || \
                                             ((__DATA_WIDTH__) == LL_ADC_DS_DATA_WIDTH_14_BIT) || \
                                             ((__DATA_WIDTH__) == LL_ADC_DS_DATA_WIDTH_15_BIT) || \
                                             ((__DATA_WIDTH__) == LL_ADC_DS_DATA_WIDTH_16_BIT)   )

#define IS_LL_ADC_DATARATIO(__DATA_RATIO__) (((__DATA_RATIO__) == LL_ADC_DS_RATIO_1) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_2) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_4) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_8) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_16) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_32) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_64) || \
                                             ((__DATA_RATIO__) == LL_ADC_DS_RATIO_128)   )

#define IS_LL_ADC_OVERRUN(__OVR__) (((__OVR__) == LL_ADC_NEW_DATA_IS_LOST)  || \
                                    ((__OVR__) == LL_ADC_NEW_DATA_IS_KEPT)    )

#define IS_LL_ADC_SAMPLINGMODE(__SAMPLING_MODE__) (((__SAMPLING_MODE__) == LL_ADC_SAMPLING_AT_START) || \
                                                   ((__SAMPLING_MODE__) == LL_ADC_SAMPLING_AT_END)     )

#define IS_LL_ADC_SAMPLERATE(__SAMPLERATE__) (((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_16)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_20)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_24)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_28)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_32)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_36)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_40)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_44)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_48)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_52)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_56)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_60)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_64)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_68)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_72)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_76)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_80)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_84)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_88)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_92)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_96)  || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_100) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_104) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_108) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_112) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_116) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_120) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_124) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_128) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_132) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_136) || \
                                              ((__SAMPLERATE__) == LL_ADC_SAMPLE_RATE_140)  )

#define IS_LL_ADC_RANK(__RANK__) (((__RANK__) == LL_ADC_RANK_1 ) || \
                                  ((__RANK__) == LL_ADC_RANK_2 ) || \
                                  ((__RANK__) == LL_ADC_RANK_3 ) || \
                                  ((__RANK__) == LL_ADC_RANK_4 ) || \
                                  ((__RANK__) == LL_ADC_RANK_5 ) || \
                                  ((__RANK__) == LL_ADC_RANK_6 ) || \
                                  ((__RANK__) == LL_ADC_RANK_7 ) || \
                                  ((__RANK__) == LL_ADC_RANK_8 ) || \
                                  ((__RANK__) == LL_ADC_RANK_9 ) || \
                                  ((__RANK__) == LL_ADC_RANK_10) || \
                                  ((__RANK__) == LL_ADC_RANK_11) || \
                                  ((__RANK__) == LL_ADC_RANK_12) || \
                                  ((__RANK__) == LL_ADC_RANK_13) || \
                                  ((__RANK__) == LL_ADC_RANK_14) || \
                                  ((__RANK__) == LL_ADC_RANK_15) || \
                                  ((__RANK__) == LL_ADC_RANK_16)   )

#define IS_LL_ADC_VOLTAGE_RANGE(__VOLTAGE_RANGE__) (((__VOLTAGE_RANGE__) == LL_ADC_VIN_RANGE_1V2) || \
                                                    ((__VOLTAGE_RANGE__) == LL_ADC_VIN_RANGE_2V4) || \
                                                    ((__VOLTAGE_RANGE__) == LL_ADC_VIN_RANGE_3V6)   )

