stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_ll_adc.c
#define IS_LL_ADC_CHANNEL(__CHANNEL__) (((__CHANNEL__) == LL_ADC_CHANNEL_VINM0)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINM1)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINM2)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINM3)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP0)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP1)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP2)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP3)       || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP0_VINM0) || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP1_VINM1) || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP2_VINM2) || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VINP3_VINM3) || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_VBAT)        || \
                                        ((__CHANNEL__) == LL_ADC_CHANNEL_TEMPSENSOR)    )

/**
  * @}
  */


/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADC_LL_Exported_Functions
  * @{
  */

/** @addtogroup ADC_LL_EF_Init
  * @{
  */

/**
  * @brief  Initialize some features of ADC instance.
  * @note   These parameters have an impact on ADC scope: ADC instance.
  *         Refer to corresponding unitary functions into
  *         @ref ADC_LL_EF_Configuration_ADC.
  * @note   The setting of these parameters by function @ref LL_ADC_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all STM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  * @param  ADCx ADC instance
  * @param  pADC_InitStruct Pointer to a @ref LL_ADC_InitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC registers are initialized
  *          - ERROR: ADC registers are not initialized
  */
ErrorStatus LL_ADC_Init(ADC_TypeDef *ADCx, const LL_ADC_InitTypeDef *pADC_InitStruct)
{
  ErrorStatus status = SUCCESS;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(ADCx));

  assert_param(IS_LL_ADC_NB_CONV(pADC_InitStruct->SequenceLength));
  assert_param(IS_LL_ADC_SAMPLINGMODE(pADC_InitStruct->SamplingMode));
  assert_param(IS_LL_ADC_SAMPLERATE(pADC_InitStruct->SampleRate));
  assert_param(IS_LL_ADC_OVERRUN(pADC_InitStruct->Overrun));

  /* Note: Hardware constraint (refer to description of this function):       */
  /*       ADC instance must be disabled.                                     */
  if (LL_ADC_IsEnabled(ADCx) == 0UL)
  {
    /* Configuration of ADC hierarchical scope:                               */
    /*  - ADC instance                                                        */
    /*    - Set ADC continuous mode                                           */
    /*    - Set ADC sequence length                                           */
    /*    - Set ADC sampling mode                                             */
    /*    - Set ADC sample rate                                               */
    /*    - Set ADC overrun                                                   */
    MODIFY_REG(ADCx->CONF, (ADC_CONF_SAMPLE_RATE_MSB
                            | ADC_CONF_SAMPLE_RATE
                            | ADC_CONF_ADC_CONT_1V2
                            | ADC_CONF_OVR_DS_CFG
                            | ADC_CONF_SEQ_LEN
                            | ADC_CONF_CONT),
               (pADC_InitStruct->SampleRate
                | pADC_InitStruct->SamplingMode
                | pADC_InitStruct->Overrun
                | ((pADC_InitStruct->SequenceLength - 1UL) << ADC_CONF_SEQ_LEN_Pos)
                | pADC_InitStruct->ContinuousConvMode));
  }
  else
  {
    /* Initialization error: ADC instance is not disabled. */
    status = ERROR;
  }

  return status;
}

/**
  * @brief  De-initialize registers of the selected ADC instance
  *         to their default reset values.
  * @note   If this functions returns error status, it means that ADC instance
  *         is in an unknown state.
  *         In this case, perform a hard reset using high level
  *         clock source RCC ADC reset.
  * @param  ADCx ADC instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC registers are de-initialized
  *          - ERROR: ADC registers are not de-initialized
  */
ErrorStatus LL_ADC_DeInit(ADC_TypeDef *ADCx)
{
  ErrorStatus status = SUCCESS;

  assert_param(IS_ADC_ALL_INSTANCE(ADCx));

  /* ========== Reset ADC registers ========== */
  /* Reset register IER */
  LL_ADC_DisableIT(ADCx, (LL_ADC_IRQ_EN_OVRDS
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
                          | LL_ADC_IRQ_EN_OVRFL
                          | LL_ADC_IRQ_EN_EODF
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
                          | LL_ADC_IRQ_EN_AWD1
                          | LL_ADC_IRQ_EN_EOS
                          | LL_ADC_IRQ_EN_EODS));

  /* Reset register ISR */
  LL_ADC_ClearActiveFlags(ADCx, (LL_ADC_IRQ_FLAG_OVRDS
#if defined(ADC_SUPPORT_AUDIO_FEATURES)
                                 | LL_ADC_IRQ_FLAG_OVRFL
                                 | LL_ADC_IRQ_FLAG_OVRDF
                                 | LL_ADC_IRQ_FLAG_EODF
#endif /* ADC_SUPPORT_AUDIO_FEATURES */
                                 | LL_ADC_IRQ_FLAG_AWD1
                                 | LL_ADC_IRQ_FLAG_EOC
                                 | LL_ADC_IRQ_FLAG_EOS
                                 | LL_ADC_IRQ_FLAG_EODS));

